[Killed] BlockStatement
D:/calculator/src/advanced.js:5:22
     return Math.pow(x, n);
 }
 
-function modulo(a, b){
-    return (a % b);
-}
+function modulo(a, b){}
 
 module.exports = {
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: undefined

[Killed] ArithmeticOperator
D:/calculator/src/advanced.js:6:13
 }
 
 function modulo(a, b){
-    return (a % b);
+    return (a * b);
 }
 
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 2
