[Killed] BlockStatement
D:/calculator/src/basic.js:1:20
-function add(a, b) {
-    return (a + b);
-}
+function add(a, b) {}
 
 function subtract(a, b) {
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: undefined

[Killed] ArithmeticOperator
D:/calculator/src/basic.js:2:13
 function add(a, b) {
-    return (a + b);
+    return (a - b);
 }
 
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 3
Received: -1

[Killed] BlockStatement
D:/calculator/src/basic.js:5:25
     return (a + b);
 }
 
-function subtract(a, b) {
-    return (a - b);
-}
+function subtract(a, b) {}
 
 function multiply(a, b) {
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: undefined

[Killed] ArithmeticOperator
D:/calculator/src/basic.js:6:13
 }
 
 function subtract(a, b) {
-    return (a - b);
+    return (a + b);
 }
 
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 3

[Killed] BlockStatement
D:/calculator/src/basic.js:9:25
     return (a - b);
 }
 
-function multiply(a, b) {
-    return (a * b);
-}
+function multiply(a, b) {}
 
 function divide(a, b) {
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: undefined

[Killed] ArithmeticOperator
D:/calculator/src/basic.js:10:13
 }
 
 function multiply(a, b) {
-    return (a * b);
+    return (a / b);
 }
 
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 0.5

[Killed] BlockStatement
D:/calculator/src/basic.js:13:23
     return (a * b);
 }
 
-function divide(a, b) {
-    return (a / b);
-}
+function divide(a, b) {}
 
 //console.log(add(2, 3));
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: undefined

[Killed] ArithmeticOperator
D:/calculator/src/basic.js:14:13
 }
 
 function divide(a, b) {
-    return (a / b);
+    return (a * b);
 }
 
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 32
